; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-15)
(:domain gripper-strips)
(:objects rooma roomb left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 )
(:init
(room rooma)
(room roomb)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 10 of 15
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 15
3. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 11 of 15
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 15
5. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 11 of 15
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 15
7. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 12 of 15
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 15
9. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 12 of 15
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 15
11. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 13 of 15
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 15
13. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 13 of 15
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 15
15. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 14 of 15
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 15
17. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 14 of 15
18. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 15
19. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 15 of 15
